In [2]:
import pandas as pd
import numpy as np

In [69]:
employeeTracker = pd.read_excel('/Users/abhisheksnehachaturvedi/Downloads/python-excel-test.xlsx')
display(employeeTracker)

    RollNo   Name Age  Salary
0        1   ABC1  25    1000
1        2   ABC2  26    1001
2        3   ABC3  27    1002
3        4   ABC4  28    1003
4        5   ABC5  29    1004
5        6   ABC6  30    1005
6        7   ABC7  31    1006
7        8   ABC8  32    1007
8        9   ABC9  33    1008
9       10  ABC10  34    1009
10      10  ABC10  34    1009
11      11  ABC11   ?   12121

In [70]:
employeeTracker.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RollNo  12 non-null     int64
 1   Name    12 non-null     object
 2   Age     12 non-null     object
 3   Salary  12 non-null     int64
dtypes: int64(2), object(2)
memory usage: 516.0+ bytes

In [71]:
employeeTracker['Age'].value_counts()

Age
34    2
25    1
26    1
27    1
28    1
29    1
30    1
31    1
32    1
33    1
?     1
Name: count, dtype: int64

In [72]:
employeeTracker = employeeTracker.replace('?', np.nan)
employeeTracker

    RollNo   Name   Age  Salary
0        1   ABC1  25.0    1000
1        2   ABC2  26.0    1001
2        3   ABC3  27.0    1002
3        4   ABC4  28.0    1003
4        5   ABC5  29.0    1004
5        6   ABC6  30.0    1005
6        7   ABC7  31.0    1006
7        8   ABC8  32.0    1007
8        9   ABC9  33.0    1008
9       10  ABC10  34.0    1009
10      10  ABC10  34.0    1009
11      11  ABC11   NaN   12121

In [73]:
employeeTracker.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RollNo  12 non-null     int64
 1   Name    12 non-null     object
 2   Age     11 non-null     float64
 3   Salary  12 non-null     int64
dtypes: float64(1), int64(2), object(1)
memory usage: 516.0+ bytes

In [74]:
employeeTracker.isnull().sum()

RollNo    0
Name      0
Age       1
Salary    0
dtype: int64

In [30]:
employeeTracker1 = employeeTracker.dropna()
employeeTracker1.shape

(11, 4)

In [91]:
employeeTracker2 = employeeTracker.fillna('5')
employeeTracker2.value_counts()

RollNo  Name   Age   Salary
10      ABC10  34.0  1009      2
1       ABC1   25.0  1000      1
2       ABC2   26.0  1001      1
3       ABC3   27.0  1002      1
4       ABC4   28.0  1003      1
5       ABC5   29.0  1004      1
6       ABC6   30.0  1005      1
7       ABC7   31.0  1006      1
8       ABC8   32.0  1007      1
9       ABC9   33.0  1008      1
11      ABC11  5     12121     1
Name: count, dtype: int64

In [76]:
employeeTracker2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RollNo  12 non-null     int64
 1   Name    12 non-null     object
 2   Age     12 non-null     object
 3   Salary  12 non-null     int64
dtypes: int64(2), object(2)
memory usage: 516.0+ bytes

In [84]:
employeeTracker2 = employeeTracker2.replace('5', np.nan)
employeeTracker2

    RollNo   Name   Age  Salary
0        1   ABC1  25.0    1000
1        2   ABC2  26.0    1001
2        3   ABC3  27.0    1002
3        4   ABC4  28.0    1003
4        5   ABC5  29.0    1004
5        6   ABC6  30.0    1005
6        7   ABC7  31.0    1006
7        8   ABC8  32.0    1007
8        9   ABC9  33.0    1008
9       10  ABC10  34.0    1009
10      10  ABC10  34.0    1009
11      11  ABC11   NaN   12121

In [92]:
employeeTracker2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RollNo  12 non-null     int64
 1   Name    12 non-null     object
 2   Age     12 non-null     object
 3   Salary  12 non-null     int64
dtypes: int64(2), object(2)
memory usage: 516.0+ bytes

In [93]:
# dropWaladf.apply(pd.to_numeric, errors='ignore')
employeeTracker3 = employeeTracker2.apply(pd.to_numeric, errors='ignore') 
employeeTracker3

    RollNo   Name   Age  Salary
0        1   ABC1  25.0    1000
1        2   ABC2  26.0    1001
2        3   ABC3  27.0    1002
3        4   ABC4  28.0    1003
4        5   ABC5  29.0    1004
5        6   ABC6  30.0    1005
6        7   ABC7  31.0    1006
7        8   ABC8  32.0    1007
8        9   ABC9  33.0    1008
9       10  ABC10  34.0    1009
10      10  ABC10  34.0    1009
11      11  ABC11   5.0   12121

In [94]:
employeeTracker3.value_counts()

RollNo  Name   Age   Salary
10      ABC10  34.0  1009      2
1       ABC1   25.0  1000      1
2       ABC2   26.0  1001      1
3       ABC3   27.0  1002      1
4       ABC4   28.0  1003      1
5       ABC5   29.0  1004      1
6       ABC6   30.0  1005      1
7       ABC7   31.0  1006      1
8       ABC8   32.0  1007      1
9       ABC9   33.0  1008      1
11      ABC11  5.0   12121     1
Name: count, dtype: int64

In [95]:
employeeTracker3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RollNo  12 non-null     int64
 1   Name    12 non-null     object
 2   Age     12 non-null     float64
 3   Salary  12 non-null     int64
dtypes: float64(1), int64(2), object(1)
memory usage: 516.0+ bytes

In [96]:
# employeeTracker3['Name'] = pd.to_numeric(employeeTracker3['Name'])
employeeTracker3['Age'] = employeeTracker3['Age'].apply(pd.to_numeric, errors='ignore')

In [97]:
employeeTracker3

    RollNo   Name   Age  Salary
0        1   ABC1  25.0    1000
1        2   ABC2  26.0    1001
2        3   ABC3  27.0    1002
3        4   ABC4  28.0    1003
4        5   ABC5  29.0    1004
5        6   ABC6  30.0    1005
6        7   ABC7  31.0    1006
7        8   ABC8  32.0    1007
8        9   ABC9  33.0    1008
9       10  ABC10  34.0    1009
10      10  ABC10  34.0    1009
11      11  ABC11   5.0   12121

In [98]:
employeeTracker3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RollNo  12 non-null     int64
 1   Name    12 non-null     object
 2   Age     12 non-null     float64
 3   Salary  12 non-null     int64
dtypes: float64(1), int64(2), object(1)
memory usage: 516.0+ bytes

In [99]:
employeeTracker3['Age'] = employeeTracker3['Age'].apply(np.int64)
print(employeeTracker3)

    RollNo   Name  Age  Salary
0        1   ABC1   25    1000
1        2   ABC2   26    1001
2        3   ABC3   27    1002
3        4   ABC4   28    1003
4        5   ABC5   29    1004
5        6   ABC6   30    1005
6        7   ABC7   31    1006
7        8   ABC8   32    1007
8        9   ABC9   33    1008
9       10  ABC10   34    1009
10      10  ABC10   34    1009
11      11  ABC11    5   12121

In [100]:
employeeTracker3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RollNo  12 non-null     int64
 1   Name    12 non-null     object
 2   Age     12 non-null     int64
 3   Salary  12 non-null     int64
dtypes: int64(3), object(1)
memory usage: 516.0+ bytes

### Convert file to CSV

In [101]:
# employeeTracker3.to_csv('FILENAME')

### DROP DUPLICATES

In [102]:
# employeeTracker3.drop_duplicates(subset='Age', keep='last')